cosc583/hw4.tex
% Created 2025-09-16 Tue 14:18
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Jackson Mowry}
\date{Tue Sep 16 09:15:56 2025}
\title{Mac Attack HW}
\hypersetup{
 pdfauthor={Jackson Mowry},
 pdftitle={Mac Attack HW},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 30.2 (Org mode 9.7.31)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\begin{enumerate}
\item How are p\textsubscript{1} and l\textsubscript{1} calculated?
\begin{itemize}
\item Padding is calculated based on the fact that we need to produce a message with a round number of bits (relative to 512 bit blocks), the message needs to have a single \texttt{1} bit added, and finally the message needs to include a 64-bit integer of the message length. We can solve this equation by solving for k in \texttt{l + 1 + k = 448mod512} where \texttt{l} is the length of m\textsubscript{1} in bits.
\item l\textsubscript{1} is calculated by adding the original message length and the required padding togther to give the final length before hashing is performed.
\end{itemize}
\item What are the contents of m'?
\begin{itemize}
\item m' would be Alice's original message m\textsubscript{1}, concatenated with the original padding p\textsubscript{1}, and finally Malory's message m\textsubscript{2}.
\item My only question here is: Assuming this was originally a text based ascii message, wouldn't the padding p\textsubscript{1} show up as a section of NULL bytes, thus effectively ending the string? If it was some other binary format with variable length data I assume these NULL bytes would simply be ignored.
\end{itemize}
\item How are p\textsubscript{2} and l\textsubscript{2} calculated?
\begin{itemize}
\item The padding and length are calculated based only on the text that Malory wants to add. This is performed in the same way as m\textsubscript{1}, just with the new information.
\end{itemize}
\item What are the inputs to SHA-1'?
\begin{itemize}
\item Malory would input both the original message digest (as internal state) from Alice's message and m\textsubscript{2} (the piece she is adding).
\item SHA-1' takes 2 inputs (message and dynamic IV), as opposed to SHA-1 which only takes the message as input.
\end{itemize}
\item How is SHA-1' used to calculate MAC\textsubscript{2}
\begin{itemize}
\item SHA-1' is initialized with MAC\textsubscript{1} to be its IV. This way we have a known ``good'' starting point that was already computed using the concatenation of Bob/Alice's shared key and Alices original message. Then Malory will input m\textsubscript{2} and receive the final digest that will be sent to bob along with m'.
\item The output from the previous step is fed into SHA-1 at the beginning of each step, so we are effectively changing out the IV that is used by default in SHA-1 to be MAC\textsubscript{1}
\item SHA-1 uses a fixed IV, whereas SHA-1' uses a dynamic value based on the message we are trying to maliciously modify
\end{itemize}
\end{enumerate}
\end{document}
